# BuiltInFailures.WallFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures Class
BuiltInFailures Class Members See Also
---
Failures about Wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class WallFailures
```

Visual Basic
---
```text
Public NotInheritable Class WallFailures
```

Visual C++
---
```text
public ref class WallFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..WallFailures
# See Also
BuiltInFailures..::..WallFailures Members
Autodesk.Revit.DB Namespace